ams/src/InformationRegisters/ДатаМобайл_СтрокиГрупповыхДокументов/ДатаМобайл_СтрокиГрупповыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаМобайл_СтрокиГрупповыхДокументов</name>
  <resources>
    <name>GS1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>KM_DecodedMrc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>KM_GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>KM_RawMrc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>KM_TNVED</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PDF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантКомплектацииНабора</name>
    <type>
      <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕгаисДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕгаисМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕгаисПолныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕгаисСправкаА</name>
    <type>
      <types>String</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕгаисСправкаБ</name>
    <type>
      <types>String</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>КМНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КМНабораСсылка</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </resources>
  <resources>
    <name>КМСсылка</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </resources>
  <resources>
    <name>КодТовара</name>
    <comment>DMArtID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Короб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоробСсылка</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Набор</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>НазваниеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоваяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>НоменклатураЕГАИС</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>ПолныйКодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПризнакПовторнойВыгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <comment>DMSN</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияСсылка</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>УпаковочныйЛист</name>
    <comment>DMPackID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УпаковочныйЛистАтрибуты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УпаковочныйЛистСсылка</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЦРПТМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦРПТМарка_Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Штрихкод</name>
    <comment>DMBarcode</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ячейка</name>
    <comment>DMCell</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаСсылка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументТСД</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДляОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <comment>DMQuant</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Уникальность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/ДатаМобайл_СтрокиГрупповыхДокументов/ManagerModule.bsl
Процедура ИзменитьДанныеЗаписи(НаборЗаписей, Результат, СтруктураСтроки, ЭтоОтменаСтроки)
	
	ТребуетсяЗапись = Ложь;
	
	ТаблицаДанных = НаборЗаписей.Выгрузить();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КМНабораСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска.КМНабораСсылка = Выборка.КМНабораСсылка;
		
		МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() Тогда
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				Если Не ЭтоОтменаСтроки Тогда
					СтрокаМассива.КоличествоНаборов = 1;
				Иначе
					СтрокаМассива.КоличествоНаборов = -1;
				КонецЕсли;
				ТребуетсяЗапись = Истина;
				Прервать;
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;  
	
	Если ТребуетсяЗапись Тогда		
		НаборЗаписей.Загрузить(ТаблицаДанных);
		Попытка
			НаборЗаписей.Записать();
		Исключение  	
		КонецПопытки;		
		
	КонецЕсли;
		
КонецПроцедуры

// Обновление данных количества маркируемых наборов в ТЧ Подбора документа ТСД.
// 
// Параметры:
//  ДокументТСД - СправочникСсылка.ДатаМобайл_ДокументыТСД - обрабатываемый документ ТСД.
//  СтруктураСтроки - Структура - структура данных передаваемой строки.
//	ЭтоОтменаСтроки - Булево - признак отмены строки.
Процедура ОбновлениеДанныхНаборов(ДокументТСД, СтруктураСтроки, ЭтоОтменаСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	
	"ВЫБРАТЬ
	|	Данные.КМНабораСсылка КАК КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Данные.Количество * Данные.КоэффициентЕдиницы) КАК Количество
	|ПОМЕСТИТЬ ДанныеПодбора
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК Данные
	|ГДЕ
	|	НЕ Данные.ВариантКомплектацииНабора = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|	И Данные.ДокументТСД = &ДокументТСД
    |   И Данные.КМНабораСсылка = &КМНабораСсылка                    
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора,
	|	Данные.Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) / СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество)
	|	КОНЕЦ КАК КоличествоВНаборе
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора
	|			ИЗ
	|				ДанныеПодбора КАК ДанныеПодбора)
    |
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
    |
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПодбора.КМНабораСсылка КАК КМНабораСсылка,
	|	ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Состав.Ссылка КАК Ссылка,
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.Характеристика КАК Характеристика,
	|	Состав.КоличествоВНаборе КАК КоличествоВНаборе
	|ПОМЕСТИТЬ ДетализацияНабораПоСоставу
	|ИЗ
	|	ДанныеПодбора КАК ДанныеПодбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Состав КАК Состав
	|		ПО ДанныеПодбора.ВариантКомплектацииНабора = Состав.Ссылка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетализацияНабораПоСоставу.КМНабораСсылка КАК КМНабораСсылка,
	|	ДетализацияНабораПоСоставу.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	ДетализацияНабораПоСоставу.Ссылка КАК Ссылка,
	|	ДетализацияНабораПоСоставу.Номенклатура КАК Номенклатура,
	|	ДетализацияНабораПоСоставу.Характеристика КАК Характеристика,
	|	ДетализацияНабораПоСоставу.КоличествоВНаборе КАК КоличествоВНаборе,
	|	ДанныеПодбора.Количество КАК Количество
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ДетализацияНабораПоСоставу КАК ДетализацияНабораПоСоставу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПодбора КАК ДанныеПодбора
	|		ПО ДетализацияНабораПоСоставу.КМНабораСсылка = ДанныеПодбора.КМНабораСсылка
	|			И ДетализацияНабораПоСоставу.Номенклатура = ДанныеПодбора.Номенклатура
	|			И ДетализацияНабораПоСоставу.Характеристика = ДанныеПодбора.ХарактеристикаНоменклатуры
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.КМНабораСсылка КАК КМНабораСсылка,
	|	СУММА(ИтоговыеДанные.КоличествоВНаборе) КАК КоличествоВНаборе,
	|	СУММА(ИтоговыеДанные.Количество) КАК Количество
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.КМНабораСсылка
	|ИМЕЮЩИЕ 
	|	СУММА(ИтоговыеДанные.КоличествоВНаборе) = СУММА(ИтоговыеДанные.Количество)";		
		
	Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД); 
	Запрос.УстановитьПараметр("КМНабораСсылка", СтруктураСтроки.КМНабораСсылка);
	
	Результат = Запрос.Выполнить(); 
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_СтрокиГрупповыхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументТСД.Установить(ДокументТСД);
	НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(СтруктураСтроки.ИдентификаторСтроки);
	НаборЗаписей.Прочитать();

	Если Не Результат.Пустой() Тогда
		
		ИзменитьДанныеЗаписи(НаборЗаписей, Результат, СтруктураСтроки, ЭтоОтменаСтроки);
		
	КонецЕсли;
	
	Если ЭтоОтменаСтроки Тогда
		
		Запрос.Текст =
		
		"ВЫБРАТЬ
		|	Данные.КМНабораСсылка КАК КМНабораСсылка,
		|	СУММА(КоличествоНаборов) КАК КоличествоНаборов
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК Данные
		|ГДЕ
		|	НЕ Данные.ВариантКомплектацииНабора = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
		|	И Данные.ДокументТСД = &ДокументТСД
	    |   И Данные.КМНабораСсылка = &КМНабораСсылка                    
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.КМНабораСсылка
		|;
	    |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.КМНабораСсылка КАК КМНабораСсылка,
		|	СУММА(Данные.КоличествоНаборов) - 1 КАК КоличествоНаборов
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|   Данные.КМНабораСсылка = &КМНабораСсылка                    
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.КМНабораСсылка
		|
		|ИМЕЮЩИЕ
		|	СУММА(Данные.КоличествоНаборов) -1 >= 0";

		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			ИзменитьДанныеЗаписи(НаборЗаписей, Результат, СтруктураСтроки, ЭтоОтменаСтроки);
									
		КонецЕсли;
		
	КонецЕсли;	
	  	
КонецПроцедуры

// Обновление данных количества наборов в регистре сведений ДатаМобайл_СтрокиГрупповыхДокументов.
// 
// Параметры:
//   СсылкаНаДок - СправочникСсылка.ДатаМобайл_ДокументыТСД - обрабатываемый документ ТСД.
//   СтруктураСтроки - Структура - Структура данных строки.
// 
Процедура ОбновлениеДанныхНаборовОбычныхТоваров(СсылкаНаДок, СтруктураСтроки) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =    
	"ВЫБРАТЬ
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД КАК ДокументТСД,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ТСД КАК ТСД,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы КАК ИмяТаблицы,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Дата КАК Дата,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ДляОбмена КАК ДляОбмена,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Количество КАК Количество,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Уникальность КАК Уникальность,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.GS1 КАК GS1,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.KM_DecodedMrc КАК KM_DecodedMrc,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.KM_GTIN КАК KM_GTIN,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.KM_RawMrc КАК KM_RawMrc,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.KM_TNVED КАК KM_TNVED,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.PDF КАК PDF,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ДатаЗаписи КАК ДатаЗаписи,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕгаисДатаРозлива КАК ЕгаисДатаРозлива,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕгаисМарка КАК ЕгаисМарка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕгаисПолныйКод КАК ЕгаисПолныйКод,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕгаисСправкаА КАК ЕгаисСправкаА,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕгаисСправкаБ КАК ЕгаисСправкаБ,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КМНабора КАК КМНабора,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КМНабораСсылка КАК КМНабораСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КМСсылка КАК КМСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КодТовара КАК КодТовара,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КоличествоВУпаковке КАК КоличествоВУпаковке,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КоличествоМест КАК КоличествоМест,
	|	0 КАК КоличествоНаборов,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Короб КАК Короб,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КоробСсылка КАК КоробСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.КоэффициентЕдиницы КАК КоэффициентЕдиницы,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара КАК НазваниеТовара,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.НоваяЦена КАК НоваяЦена,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ПолныйКодМаркировки КАК ПолныйКодМаркировки,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ПризнакПовторнойВыгрузки КАК ПризнакПовторнойВыгрузки,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер КАК СерийныйНомер,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.СерияСсылка КАК СерияСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛистАтрибуты КАК УпаковочныйЛистАтрибуты,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЦРПТМарка КАК ЦРПТМарка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЦРПТМарка_Длина КАК ЦРПТМарка_Длина,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод КАК Штрихкод,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Ячейка КАК Ячейка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка КАК ЯчейкаСсылка,
	|	ДатаМобайл_СтрокиГрупповыхДокументов.Пользователь КАК Пользователь 
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
	|ГДЕ
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &ДокументТСД	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.КМНабораСсылка КАК КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Данные.Количество * Данные.КоэффициентЕдиницы) КАК Количество
	|ПОМЕСТИТЬ ДанныеПодбора
	|ИЗ
	|	ДанныеДокумента КАК Данные
	|ГДЕ
	|	НЕ Данные.ВариантКомплектацииНабора = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|	И Данные.КМНабораСсылка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора,
	|	Данные.Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВариантКомплектацииНабора,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) / СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество)
	|	КОНЕЦ КАК КоличествоВНаборе
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора
	|			ИЗ
	|				ДанныеПодбора КАК ДанныеПодбора)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПодбора.КМНабораСсылка КАК КМНабораСсылка,
	|	Состав.Ссылка КАК ВариантКомплектацииНабора,
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ДанныеПодбора.Количество, 0) КАК КоличествоФакт,
	|	Состав.КоличествоВНаборе КАК КоличествоНабор
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ДанныеПодбора КАК ДанныеПодбора
	|		ПРАВОЕ СОЕДИНЕНИЕ Состав КАК Состав
	|		ПО ДанныеПодбора.ВариантКомплектацииНабора = Состав.Ссылка
	|			И ДанныеПодбора.Номенклатура = Состав.Номенклатура
	|			И ДанныеПодбора.ХарактеристикаНоменклатуры = Состав.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	МИНИМУМ(ИтоговыеДанные.КоличествоФакт / ИтоговыеДанные.КоличествоНабор) КАК КоличествоФакт
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.ВариантКомплектацииНабора
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ИтоговыеДанные.КоличествоФакт / ИтоговыеДанные.КоличествоНабор) >= 1";
	
	Запрос.УстановитьПараметр("ДокументТСД", СсылкаНаДок);
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаДанных = МассивРезультатов[0].Выгрузить();
	
	СтруктураПоиска = Новый Структура; 
	СтруктураПоиска.Вставить("ВариантКомплектацииНабора", Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка());
	
	Если Не МассивРезультатов[4].Пустой() Тогда 
		
		Выборка = МассивРезультатов[4].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПоиска.ВариантКомплектацииНабора = Выборка.ВариантКомплектацииНабора;
			
			МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() Тогда
				
				МассивСтрок[0].КоличествоНаборов = Окр(Выборка.КоличествоФакт, 0, РежимОкругления.Окр15как10);		
				
			КонецЕсли;			
			
			Продолжить;
			
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_СтрокиГрупповыхДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументТСД.Установить(СсылкаНаДок);
		НаборЗаписей.Прочитать();	
		НаборЗаписей.Загрузить(ТаблицаДанных);
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;	
	
КонецПроцедуры
